app/views/buy_items/index.slim

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          tr
            td = Category.find(val.category_id).name ||= ""