app/views/buy_items/log_view.slim

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        tr
          td = Category.find(item.category_id).name ||= ""