app/controllers/buy_items_controller.rb

  def create
      if BuyItem.buy_approval(params[:buy_item][:category_id]).blank?
---
SELECT to_char(created_at, 'yyyy-mm') as buy_month, sum(price) as month_price FROM "buy_items" WHERE "buy_items"."approval" = $1 GROUP BY buy_month ORDER BY buy_month  [["approval", true]]