app/controllers/buy_items_controller.rb

  def index
    #今月/前月/前々月のデータ取得
    month_hash = {
      this_month: Time.current.all_month,
      one_month_ago: 1.months.ago.all_month,
      two_month_ago: 2.months.ago.all_month
    }

    @buy_items_hash = {}
    month_hash.each do |key, value|
      @buy_items_hash[key] = BuyItem.by_month_buy(value)
    end

    @buy_items_ary = []
    (BuyItem.by_month_buy(1.months.ago.all_month)).each do |tmp|
---
SELECT  "buy_items".* FROM "buy_items" WHERE "buy_items"."created_at" BETWEEN $1 AND $2 ORDER BY "buy_items"."id" ASC LIMIT $3  [["created_at", "2019-11-01 00:00:00"], ["created_at", "2019-11-30 23:59:59.999999"], ["LIMIT", 1]]

  def create
      if BuyItem.buy_approval(params[:buy_item][:category_id]).blank?
          buy_item = params.require(:buy_item).permit(:category_id, :name, :price)
          BuyItem.create(buy_item)
---
SELECT to_char(created_at, 'yyyy-mm') as buy_month, sum(price) as month_price FROM "buy_items" WHERE "buy_items"."approval" = $1 GROUP BY buy_month ORDER BY buy_month  [["approval", true]]
INSERT INTO "buy_items" ("category_id", "name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 3], ["name", "aaaaaaaaaaa"], ["price", 100], ["created_at", "2019-11-13 03:01:50.213700"], ["updated_at", "2019-11-13 03:01:50.213700"]]

  def log_view
    @buy_items = BuyItem.all
---
SELECT to_char(created_at, 'yyyy-mm') as buy_month, sum(price) as month_price FROM "buy_items" GROUP BY buy_month ORDER BY buy_month

  def chart_view
    @chart_data = BuyItem.chart_scope.map {|item| [item.buy_month, item.month_price]}
---
SELECT to_char(created_at, 'yyyy-mm') as buy_month, sum(price) as month_price FROM "buy_items" GROUP BY buy_month ORDER BY buy_month