app/models/buy_item.rb

SELECT "buy_items"."category_id", "buy_items"."name", "buy_items"."price" FROM "buy_items" WHERE "buy_items"."approval" = $1 AND "buy_items"."created_at" BETWEEN $2 AND $3  [["approval", true], ["created_at", "2019-11-01 00:00:00"], ["created_at", "2019-11-30 23:59:59.999999"]]
---
  scope :by_month_buy,-> (month) {
    where(approval: true, created_at: month)#.pluck(:category_id, :name, :price)

SELECT to_char(created_at, 'yyyy-mm') as buy_month, sum(price) as month_price FROM "buy_items" WHERE "buy_items"."approval" = $1 GROUP BY buy_month ORDER BY desc buy_month  [["approval", true]]
---
  scope :total_amount_of_month, -> {
    select("to_char(created_at, 'yyyy-mm') as buy_month, sum(price) as month_price")
    .where(approval: true)
    .order("buy_month")
    .group("buy_month")
    .map{ |tmp| {buy_month: tmp.buy_month, month_price: tmp.month_price}}