app/models/category.rb

  scope :category_list, -> { all.pluck(:name, :id)}
---
SELECT "categories"."name", "categories"."id" FROM "categories"